ADMIN_MENU = """
Запланировано постов: <code>{}</code>

Промежуток между постами: <code>{} минут</code>
ID канала: <code>{}</code>

Описание: {}
"""


QUEUE_LIST = """
<b>Ближайшие запланированные посты:</b>

{}
"""


CHANGE_CHANNEL_ID = """
Перешлите пост из канала в котором вы хотите подключить отправку постов:
"""


ERROR_CHANNEL_ID = """
Сообщение переслано не из канала!
"""


ERROR_CHANNEL_ID_NONE_BOT = """
Бот не состоит в данном канале!
"""


DONE_CHANNEL_ID = """
Канал для постинга успешно обновлён на <code>{}</code>!
"""


CHANGE_DESCRIPTION = """
Отправьте новое описание которое будет приписано ниже к промту.
"""


INPUT_DESCRIPTION = """
Описание успешно обновлено!
"""


ERROR_PROMPT = """
Произошла ошибка с промтом!
Попробуйте пожалуйста другую генерацию.
"""


OLD_DATE = """
Слишком старая дата!
"""


SEND_POST = """
<b>✏️ Промт:</b> <code>{}</code>

{}
"""


ERROR_SEND_POST = """
Произошла ошибка при отправке поста.
"""